RIET/src/DataProcessors/AULoading/AULoading.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AULoading</name>
  <tabularSections>
    <name>СписокНомеров</name>
    <attributes>
      <name>НомерAU</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/DataProcessors/AULoading/Forms/ФормаУправляемая/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////
// ВЫБОР ФАЙЛА

&НаКлиенте
Процедура ПредставлениеПутиКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьФайл();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьФайл()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр						= "Файлы csv (*.csv)|*.csv|Файлы xls (*.xls)|*.xls|Файлы xlsx (*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		FullPath = ДиалогВыбораФайла.ПолноеИмяФайла;
				
	КонецЕсли;
		
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА

#Если не ВебКлиент Тогда
	
&НаСервере
Процедура СкопироватьФайлИЗагрузитьДанные()

	ВыбранныеНомераAU = Объект.СписокНомеров.Выгрузить().ВыгрузитьКолонку("НомерAU");	
	Обработки.AULoading.ЗагрузитьAccountingUnitsИзAU_master(ВыбранныеНомераAU);

КонецПроцедуры // ()
 	
	
&НаКлиенте
Функция КонтрольЗаполненияСтроки(ТабличныйДокумент, НомерСтроки, ТекстыЯчеек = Неопределено, КоличествоОшибок = 0)
	
	ТекстыЯчеек = Новый Массив;
	Для к = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ТекстыЯчеек.Добавить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(К,"ЧГ=")).Текст));
	КонецЦикла;
	ТекущаяСтрока     = Новый Структура;
	ТекущаяСтрока.Вставить("НомерAU", ТекстыЯчеек[0]);
	
	Возврат ТекущаяСтрока;
	
КонецФункции	

&НаКлиенте
Процедура Load(Команда)
	
	//Прочитаем номера AU в первой колонке табличного документа
	
	Для К = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		//НомерТекущейСтроки = ЭлементыФормы.Индикатор.Значение + 1;
		ТекстыЯчеек = Неопределено;
		//Отказ = Ложь;
		ТекущаяСтрока = КонтрольЗаполненияСтроки(ТабличныйДокумент, К, ТекстыЯчеек);
		НоваяСтрока = Объект.СписокНомеров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(FullPath) Тогда
		
		СкопироватьФайлИЗагрузитьДанные();
		
		Возврат;
		
		//ВыбратьФайл();
		//
		//Если НЕ ЗначениеЗаполнено(FullPath) Тогда
		//	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//		"Select file!",
		//		, "Объект", "FullPath");
		//		Возврат;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	 
	Состояние("File loading...");
	
	Если НЕ РГСофтКлиентСервер.ФайлДоступенДляЗагрузки(FullPath) Тогда
		Возврат;
	КонецЕсли;
	
	
	Файл = Новый Файл(FullPath);
	// } RGS LFedotova 31.01.2018 16:23:27 - вопрос S-I-0004504 
	//ПолноеИмяXLSФайла = Неопределено;
	ПолноеИмяФайла = Неопределено;
	// { RGS LFedotova 31.01.2018 16:23:00 - вопрос S-I-0004504
	РасширениеФайла = НРег(Файл.Расширение);
	
	
	// } RGS LFedotova 31.01.2018 16:23:27 - вопрос S-I-0004504 
	//Если РасширениеФайла = ".xls" или РасширениеФайла = ".xlsx" Тогда
	//	
	//	ПолноеИмяXLSФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	//	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	//	КопироватьФайл(FullPath, ПолноеИмяXLSФайла);
	Если РасширениеФайла = ".csv" ИЛИ РасширениеФайла = ".xls" или РасширениеФайла = ".xlsx" Тогда
	// { RGS LFedotova 31.01.2018 16:23:00 - вопрос S-I-0004504
		
		ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
		КопироватьФайл(FullPath, ПолноеИмяФайла);
		
	КонецЕсли; 
	
	// } RGS LFedotova 31.01.2018 16:23:27 - вопрос S-I-0004504 
	//ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяXLSФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	// { RGS LFedotova 31.01.2018 16:23:00 - вопрос S-I-0004504
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	  	
	ЗагрузитьДанныеНаСервере(АдресФайла, РасширениеФайла);
	
	// } RGS LFedotova 31.01.2018 16:23:27 - вопрос S-I-0004504 
	//УдалитьФайлы(ПолноеИмяXLSФайла);
	УдалитьФайлы(ПолноеИмяФайла);
	// { RGS LFedotova 31.01.2018 16:23:00 - вопрос S-I-0004504
	
	Сообщить("File was successfully loaded.");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресФайла, РасширениеФайла)
	
	// { RGS LFedotova 31.01.2018 16:31:29 - вопрос S-I-0004504
	//ПолноеИмяXLSФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	//ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	//ДвоичныеДанные.Записать(ПолноеИмяXLSФайла);
	//
	//ВыбранныеНомераAU = Объект.СписокНомеров.Выгрузить().ВыгрузитьКолонку("НомерAU");

	//Обработки.AULoading.ЗагрузитьДанныеИзФайла(ПолноеИмяXLSФайла, ВыбранныеНомераAU);
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанные.Записать(ПолноеИмяФайла);
	
	ВыбранныеНомераAU = Объект.СписокНомеров.Выгрузить().ВыгрузитьКолонку("НомерAU");

	Если РасширениеФайла = ".csv" Тогда
		Обработки.AULoading.ЗагрузитьДанныеИзФайла_csv(ПолноеИмяФайла, ВыбранныеНомераAU);
	ИначеЕсли РасширениеФайла = ".xls" Тогда
		Обработки.AULoading.ЗагрузитьДанныеИзФайла_xls(ПолноеИмяФайла, ВыбранныеНомераAU);
	КонецЕсли;
	
	// } RGS LFedotova 31.01.2018 16:33:30 - вопрос S-I-0004504	
		
КонецПроцедуры


#КонецЕсли
